#include "pch.h"
#include "Model.h"

//----------------------------------------------------//
// コンストラクタ
//----------------------------------------------------//
Model::Model()
	:m_modelHandle(-1)
{
}

//----------------------------------------------------//
// デストラクタ
//----------------------------------------------------//
Model::~Model()
{
	// @@@何かしらデータが入ったら正の値が入るから0を基準にしてるんだよな恐らく
	if (m_modelHandle > 0)
	{
		MV1DeleteModel(m_modelHandle);
	}

}

//----------------------------------------------------//
// モデルの読み込み
//----------------------------------------------------//
void Model::LoadModel(const TCHAR* in_modelFile)
{
	m_modelHandle = MV1LoadModel(in_modelFile);
	if (m_modelHandle < 0)
	{
		// @@@sourceId:%d.................?
		printfDx("データ読み込みに失敗. sourceId:%d", in_modelFile);
	}
}

//----------------------------------------------------//
// モデルの描画
//----------------------------------------------------//
void Model::Draw()
{
	MV1DrawModel(m_modelHandle);

}

//----------------------------------------------------//
// ポジションの設定
//----------------------------------------------------//
void Model::SetPos(const VECTOR &in_pos)
{
	MV1SetPosition(m_modelHandle, in_pos);
}
